INSERT INTO Service_center.`addresses`
(`city`, `street`, `house`, `flat`, `entrance`, `floor`)
VALUES
  ('Днепр', 'пр. Яворницкого', '50', 15, '1', 4),
  ('Днепр', 'пр. Поля', '100', 123, '2', 10),
  ('Днепр', 'ул. Сичеславская Набережная', '47', 59, NULL, 7),
  ('Днепр', 'ул. Набережная Заводская', '93', NULL, NULL, NULL),
  ('Днепр', 'пр. Яворницкого', '63', 84, '3', 2),
  ('Днепр', 'ул. Набережная Победы', '42', 58, '2', 5),
  ('Днепр', 'пр. Поля', '87', NULL, NULL, NULL),
  ('Днепр', 'пер. Парусный', '1', 150, 'г', 9),
  ('Днепр', 'ул. Метростроевская', '10', 3, '5', 1),
  ('Днепр', 'ж/м Парус', '1а', 50, NULL, 5),
  ('Днепр', 'ж/м Парус', '1', 35, 'в', 9);


INSERT INTO Service_center.`clients`
(`Addresses_id`, `name`, `phone`)
VALUES
  (1, 'Дарт Вейдер', '+380952383748'),
  (2, 'Иванова Елена Александровна', '+380999688198'),
  (5, 'Александр Дюма', '+380964516931'),
  (9, 'Каземир Малевич', '+380633920809'),
  (6, 'Петрова Виолетта Федоровна', '+380939443442');


INSERT INTO Service_center.`teams`
(`name`)
VALUES
  ('Бригада 1'),
  ('Бригада 2'),
  ('Бригада 3');


INSERT INTO Service_center.`masters`
(`Addresses_id`, `Teams_id`, `name`, `date`, `phone`)
VALUES
  (3, 1, 'Иванов Иван Иванович', '1970-01-01', '+380672443117'),
  (4, 1, 'Петров Петр Петрович', '1970-01-02', '+380680060365'),
  (7, 2, 'Сидоров Сидор Сидорович', '1970-01-03', '+380503706510'),
  (8, 2, 'Александров Александр Александрович', '1990-05-05', '+380664323008'),
  (10, 3, 'Кашпировский Анатолий Иванович', '1955-08-05', '+380970301356'),
  (11, 3, 'Полуэктов Полуэкт Полуэктович', '1965-09-23', '+380989652044');


INSERT INTO Service_center.`services`
(`name`)
VALUES
  ('Установка стиральной машины'),
  ('Установка кондиционера'),
  ('Установка водонагревателя'),
  ('Установка кухонной техники (электро)'),
  ('Установка кухонной техники (газ)'),
  ('Профилактика кондиционера'),
  ('Профилактика водонагревателя'),
  ('Ремонт стиральной машины'),
  ('Ремонт кондиционера'),
  ('Ремонт водонагревателя'),
  ('Ремонт кухонной техники (электро)'),
  ('Ремонт кухонной техники (газ)'),
  ('Ремонт холодильника');


INSERT INTO Service_center.`teams_services`
(`Services_id`, `Teams_id`)
VALUES
  (1, 1),
  (2, 1),
  (3, 1),
  (6, 1),
  (7, 1),
  (1, 2),
  (4, 2),
  (5, 2),
  (11, 2),
  (12, 2),
  (1, 3),
  (2, 3),
  (3, 3),
  (6, 3),
  (7, 3),
  (8, 3),
  (9, 3),
  (10, 3),
  (13, 3);


INSERT INTO Service_center.`states`
(`name`)
VALUES
  ('Принят'),
  ('Назначен выезд'),
  ('Отложен'),
  ('Заказана деталь'),
  ('Выполнен');


INSERT INTO Service_center.`orders`
(`Clients_id`, `Services_id`, `States_id`, `Teams_id`,
 `date_order`, `date_execution`, `client_comment`, `master_comment`)
VALUES
  (5, 9, 5, 3, '2017-05-27 21:00:00', '2017-05-30', 'не охлаждает', 'была утечка фреона'),
  (4, 6, 5, 1, '2017-05-28 21:00:00', '2017-05-31', NULL, NULL),
  (1, 1, 5, 2, '2017-05-29 21:00:00', '2017-06-01', NULL, NULL),
  (3, 3, 2, 3, '2017-05-30 21:00:00', '2017-06-02', NULL, NULL),
  (2, 2, 2, 1, '2017-05-30 21:00:00', '2017-06-02', NULL, NULL),
  (1, 1, DEFAULT, NULL, NULL, NULL, NULL, NULL);
